app/Controllers/Home.php

    public function mkrequest(){

        $session = \Config\Services::session();
        $data["session"] = $session;
        $db      = \Config\Database::connect();
        $data = [];

        $model2 = new VTypeModel();
        $tList = $model2->findAll();

        $builder = $db->table('user_details');


        $data['types'] = $tList;


            $builder->select('*');
            $query = $builder->getWhere(['userType'=>'d', 'delStatus'=>'n']);
---
SELECT *
FROM `user_details`
WHERE `userType` = 'd'
AND `delStatus` = 'n'