app/Controllers/VehicleControl.php

SELECT *
FROM `vehicles`
WHERE `vehicles`.`v_id` = '1'
---
    public function getVehicle()
    {

        try {

            $model = new VehicleModel();
            $searchId = $this->request->getPost("vid");
            $data['vehicles'] = $model->find($searchId);