app/Controllers/VehicleControl.php

SELECT *
FROM `vehicles`
JOIN `vehicle_master_data` ON `vehicle_master_data`.`vm_id` = `vehicles`.`vm_id`
LEFT JOIN `user_details` ON `user_details`.`uid` = `vehicles`.`uid`
ORDER BY `vehicles`.`v_id`
SELECT *
FROM `vehicle_master_data`
SELECT *
FROM `user_details`
WHERE `userType` = 'd'
AND `delStatus` = 'n'
---
    public function index()
    {
        $session = \Config\Services::session();
        $data["session"] = $session;
        $db      = \Config\Database::connect();
        $builder = $db->table('vehicles');


        $model = new VehicleModel();
        $model2 = new VTypeModel();
        $model3 = new UserModel();


        try {

            $builder->select('*');
            $builder->join('vehicle_master_data', 'vehicle_master_data.vm_id = vehicles.vm_id');
            $builder->join('user_details', 'user_details.uid = vehicles.uid','left');
            $builder->orderBy('vehicles.v_id');
            $vList = $builder->get()->getResultArray();

            $builder = $db->table('user_details');
            $query = $builder->getWhere(['userType'=>'d', 'delStatus'=>'n']);

SELECT *
FROM `user_details`
WHERE `userType` = 'd'
AND `delStatus` = 'n'
---
    public function drivers(){


        $data = [];
        $session = \Config\Services::session();
        $data["session"] = $session;
        $db      = \Config\Database::connect();
        $builder = $db->table('user_details');


        try {


            // // $builder->select('*');
            $query = $builder->getWhere(['userType'=>'d', 'delStatus'=>'n']);